import React from 'react'

function WeatherList() {
  const list = {
    // 雷雨
    200: '小雨で雷を伴う',
    201: '雷雨',
    202: '強い雨で雷を伴う',
    210: '雷',
    211: '雷雨',
    212: '強い雷雨',
    221: '局地的雷雨',
    230: '薄い霧で雷を伴う',
    231: '霧雨で雷を伴う',
    232: '濃い霧雨で雷を伴う',
    // 霧雨
    300: 'もや',
    301: '霧',
    302: '濃霧',
    310: '霧雨',
    311: '小雨',
    312: '濃霧の伴う雨',
    313: '霧所によりにわか雨',
    314: '霧所により強いにわか雨',
    321: 'にわか霧',
    // 雨
    500: '小雨',
    501: '雨',
    502: 'やや強い雨',
    503: '強い雨',
    504: '激しい雨',
    511: '冷たい雨',
    520: '小雨',
    521: 'にわか雨',
    522: '強いにわか雨',
    531: '局地的にわか雨',
    // 雪
    600: '小雪',
    601: '雪',
    602: '大雪',
    611: 'みぞれ',
    612: 'にわかみぞれ',
    615: '小雨所により雪',
    616: '雨所により雪',
    620: 'にわか小雪',
    621: 'にわか雪',
    622: '強いにわか雪',
    // 大気汚染
    701: '霧',
    711: 'スモッグ',
    721: '煙霧',
    731: '黄砂',
    741: '濃霧',
    751: '黄砂',
    761: '塵',
    762: '火山灰',
    771: 'スコール',
    781: '竜巻',
    // 晴れ
    800: '晴れ',
    // 曇り
    801: '晴れ所により曇り',
    802: '曇り所により晴れ',
    803: '曇り時々晴れ',
    804: '曇り'
  };

  return list;
}

export default WeatherList